# Evaluate Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Edge..::..Evaluate Method
Edge Class See Also
---
Evaluates a parameter on the edge.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public XYZ Evaluate(
	double param
)
```

Visual Basic
---
```text
Public Function Evaluate ( _
	param As Double _
) As XYZ
```

Visual C++
---
```text
public:
XYZ^ Evaluate(
	double param
)
```

# ### Parameters
param
    Type: System..::..DoubleThe parameter to be evaluated, in [0,1].
# See Also
Edge Class
Autodesk.Revit.DB Namespace